Repository: lvitals/z80asm
Catalog: po/*.po
Languages: pt_br

source: Usage: %s [options] [input files] Possible options are: -h --help Display this help text and exit. -V --version Display version information and exit. -v --verbose Be verbose. Specify again to be more verbose. -l --list Write a list file. -L --label Write a label file.
pt_br: Uso: %s [opções] [arquivos de entrada] Possíveis opções são: -h --help Exibe este texto de ajuda e sai. -V --version Exibe informações da versão e sai. -v --verbose Seja verboso. Especifique novamente para ser mais verboso. -l --list Escreve um arquivo de lista. -L --label Escreve um arquivo de rótulos.

source: -p --label-prefix prefix all labels with this prefix. -i --input Specify an input file (-i may be omitted). -o --output Specify the output file. -I --includepath Add a directory to the include path. Please send bug reports and feature requests to <shevek@fmf.nl>
pt_br: -p --label-prefix prefixa todos os rótulos com este prefixo. -i --input Especifica um arquivo de entrada (-i pode ser omitido). -o --output Especifica o arquivo de saída. -I --includepath Adiciona um diretório ao caminho de inclusão. Por favor, envie relatórios de bugs e solicitações de recursos para <shevek@fmf.nl>

source: Z80 assembler version
pt_br: Montador Z80 versão

source: Verbosity increased to level %d
pt_br: Verbosity aumentada para o nível %d

source: output file
pt_br: arquivo de saída

source: Opened outputfile
pt_br: Arquivo de saída aberto

source: list file
pt_br: arquivo de lista

source: Opened list file
pt_br: Arquivo de lista aberto

source: label file
pt_br: arquivo de rótulos

source: Opened label file
pt_br: Arquivo de rótulos aberto

source: Assembling....
pt_br: Montando....

source: *** 1 error found ***
pt_br: *** 1 erro encontrado ***

source: *** %d errors found ***
pt_br: *** %d erros encontrados ***

source: Assembly succesful.
pt_br: Montagem bem-sucedida.

source: `,' expected. Remainder of line: %s
pt_br: `,' esperado. Restante da linha: %s

source: unexpected end of line
pt_br: fim de linha inesperado

source: Piece of code found:
pt_br: Trecho de código encontrado:

source: Remainder of line
pt_br: Restante da linha

source: parse error. Remainder of line=%s
pt_br: erro de análise. Restante da linha=%s

source: When looking for any of:
pt_br: Ao procurar por qualquer um dos:

source: `:' found without a label
pt_br: `:' encontrado sem um rótulo

source: duplicate definition of label %s
pt_br: definição duplicada do rótulo %s

source: not enough memory to store label %s
pt_br: memória insuficiente para armazenar o rótulo %s

source: Label found
pt_br: Rótulo encontrado

source: write_one_byte called with argument
pt_br: write_one_byte chamado com argumento

source: nested macro found in line %d - did you forget an endm?
pt_br: macro aninhada encontrada na linha %d - você esqueceu um endm?
